#include <iostream>
using namespace std;
int main() {
	// необходимо чтобы программа выводила вот такую последовательность 7 14 21 28 35 42 49 56 63 70 77 84 91 98
	//int i = 7;
	//while (i <= 98) {
	//	cout << i << "";
	//	i += 7;
	//}
	//необходимо чтобы программа выводила вот такую последовательность 1 2  4  8 16 32 64 128 256 512
//	int i = 1;
//	while (i <= 512) {
//		cout << i << " ";
//	}		i *= 2;
//8. ƒаны натуральные числа от 20 до 50.Ќапечатать те из них, которые дел€тс€ на 3, но не дел€тс€ на 5.

// i % 3 == 0 - делитс€ на 3
// i % 5 != 0 - не делитс€ на 5
	int i = 20;
	while (i <=50) {
		if (i % 3 == 0 && i % 5 != 0) {
		}	cout << i << " ";

		}
		i++;
	}
	//10. ƒаны натуральные числа от 1 до 50. Ќайти сумму тех из них, которые дел€тс€ на 5 или на 7.
	//int i = 1;
	//int s = 0;
	//while (i <= 50) {

		//if (i % 5 == 0 || i % 7 == 0) {
		//	s += i;
		//}
	
			//i += 1;
		

	//}
	//cout << s;
	//11. Ќапечатать те из двузначных чисел которые дел€тс€ на 4, но не дел€тс€ на 6.
	//int i = 20;
	//while (i <= 50) {
		//if (i % 4 == 0 && i % 6 != 0) {
		//}		 cout << i << " ";
		//i++;
	//}
	//12. Ќайти произведение двузначных нечетных чисел кратных 13.
	//int i = 1;
	//int s = 0;
	//while (i <= 50) {

	//	if (i % 2 != 0 || i % 13 == 0) {
	//		s += i;
	//	}

	//		i += 1;


	//}
	//cout << s;
}

    



